
/**
 * Муравьиный алгоритм (алгоритм оптимизации подражанием муравьиной колонии, англ. ant colony optimization, ACO) — один
 * из эффективных полиномиальных алгоритмов для нахождения приближённых решений задачи коммивояжёра, а также решения
 * аналогичных задач поиска маршрутов на графах. Суть подхода заключается в анализе и использовании модели поведения
 * муравьёв, ищущих пути от колонии к источнику питания и представляет собой метаэвристическую оптимизацию. Первая
 * версия алгоритма, предложенная доктором наук Марко Дориго[1][2] в 1992 году, была направлена на поиск оптимального
 * пути в графе.
 *
 * */
package algorithms.aco_ant_colony_optimization;