package other;

public class DivideAndRule {
    public static void main(String[] args) {

    }
}

/*
------------------------------------------------------------------------------------------------------------------------
Решение задачи методом «разделяй и властвуй ~ состоит из двух шагов:
        1. Сначала определяется базовый случай. Это должен быть простейший случай из всех возможных.
        2. Задача делится или сокращается до тех пор, пока не будет сведена к базовому случаю .

------------------------------------------------------------------------------------------------------------------------
*/